InformationRegisters/ПодборКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПодборКурьераКЗаказу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветКурьера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодбораКурьераКЗаказу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыПодбораКурьеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭтапыПодбораКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыПодбораКурьераКЗаказу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииПодбораКурьераКЗаказу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПодбораКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПодбораКурьераКЗаказу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БеруВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеБеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадииДоставкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтадииДоставкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодборКурьера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадииПодбораКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтадииПодбораКурьераКЗаказу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеКурьеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовыеКурьерыСПриоритетом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовыеКурьеры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКурьеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКурьеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дополнительный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыГотовностиКурьеровКРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыГотовностиКурьеровКРаботе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГотов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииДоставкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Курьеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Курьеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКурьера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКурьеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовностьКРаботе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыГотовностиКурьеровКРаботе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриоритетныеМагазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МенеджерКонтроляЗаказов/Ext/Module.bsl
Процедура КонтрольОпаздывающихКурьеров() Экспорт  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодборКурьераКЗаказу.СрезПоследних КАК ПодборКурьераКЗаказуСрезПоследних
		|		ПО Заказы.Ссылка = ПодборКурьераКЗаказуСрезПоследних.Заказ
		|ГДЕ
		|	ПодборКурьераКЗаказуСрезПоследних.ОтветКурьера = ЗНАЧЕНИЕ(Перечисление.СтатусыПодбораКурьераКЗаказу.БеруВРаботу)
		|	И Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.Начат)
		|	И РАЗНОСТЬДАТ(ПодборКурьераКЗаказуСрезПоследних.Период, &ТекущееВремя, МИНУТА) >= 60";
	Запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
		ЗаказОбъект.Состояние = Перечисления.СтадииДоставкиЗаказа.Задерживается;
		ЗаказОбъект.Записать();
	КонецЦикла;
КонецПроцедуры 


Процедура ПодборКурьеровКЗаказу() Экспорт 
	ПодборДляНовыхЗаказов(); 
	ПодборДляНеотвеченныхЗаказов();
	ОтменитьНевзятыеЗаказы();	
КонецПроцедуры
 

Процедура ПодборДляНовыхЗаказов() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	НЕ Заказ.Ссылка В
		|				(ВЫБРАТЬ
		|					ЭтапыПодбораКурьераКЗаказуСрезПоследних.Заказ КАК Заказ
		|				ИЗ
		|					РегистрСведений.ЭтапыПодбораКурьераКЗаказу.СрезПоследних КАК ЭтапыПодбораКурьераКЗаказуСрезПоследних)
		|	И Заказ.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.ПодборКурьера)";	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		ПредложитьЗаказОсновнымКурьерам(ЗаказСсылка);
	КонецЦикла;
КонецПроцедуры


Процедура ПодборДляНеотвеченныхЗаказов()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПодбораКурьераКЗаказуСрезПоследних.Заказ КАК Заказ,
		|	ЭтапыПодбораКурьераКЗаказуСрезПоследних.Этап КАК Этап
		|ИЗ
		|	РегистрСведений.ЭтапыПодбораКурьераКЗаказу.СрезПоследних КАК ЭтапыПодбораКурьераКЗаказуСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказы
		|		ПО (ЭтапыПодбораКурьераКЗаказуСрезПоследних.Заказ = Заказы.Ссылка)
		|ГДЕ
		|	РАЗНОСТЬДАТ(ЭтапыПодбораКурьераКЗаказуСрезПоследних.Период, &ТекущаяДата, МИНУТА) >= 30
		|	И Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.ПодборКурьера)";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Заказ;
		ЗаказМагазин = ЗаказСсылка.ПолучитьОбъект().Магазин;
		ЗаказЭтап = ВыборкаДетальныеЗаписи.Этап;
		Если ЗаказЭтап = Перечисления.СтадииПодбораКурьераКЗаказу.ОсновныеКурьеры Тогда
			ПредложитьЗаказГотовымКурьерамСПриоритетом(ЗаказСсылка, ЗаказМагазин);    
			Иначе Если ЗаказЭтап = Перечисления.СтадииПодбораКурьераКЗаказу.ГотовыеКурьерыСПриоритетом Тогда
				ПредложитьЗаказГотовымКурьерам(ЗаказСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ОтменитьНевзятыеЗаказы() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПодбораКурьераКЗаказуСрезПоследних.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.ЭтапыПодбораКурьераКЗаказу.СрезПоследних КАК ЭтапыПодбораКурьераКЗаказуСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказы
		|		ПО ЭтапыПодбораКурьераКЗаказуСрезПоследних.Заказ = Заказы.Ссылка
		|ГДЕ
		|	РАЗНОСТЬДАТ(ЭтапыПодбораКурьераКЗаказуСрезПоследних.Период, &ТекущаяДата, МИНУТА) >= 10
		|	И Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.ПодборКурьера)
		|	И ЭтапыПодбораКурьераКЗаказуСрезПоследних.Этап = ЗНАЧЕНИЕ(Перечисление.СтадииПодбораКурьераКЗаказу.ГотовыеКурьеры)";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Заказ; 
		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
		ЗаказОбъект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
		ЗаказОбъект.Записать();
	КонецЦикла;
КонецПроцедуры


Процедура ПредложитьЗаказОсновнымКурьерам(Заказ)  
	НачатьНовыйЭтапПодбораКурьераКЗаказу(Заказ, Перечисления.СтадииПодбораКурьераКЗаказу.ОсновныеКурьеры);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Курьеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Курьеры КАК Курьеры
		|ГДЕ
		|	Курьеры.ВидКурьера = ЗНАЧЕНИЕ(Перечисление.ВидыКурьеров.Основной)";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Курьер = ВыборкаДетальныеЗаписи.Ссылка;
		ПредложитьКурьеруЗаказ(Заказ, Курьер)
	КонецЦикла;	
КонецПроцедуры      

Процедура ПредложитьЗаказГотовымКурьерамСПриоритетом(Заказ, Магазин)
	НачатьНовыйЭтапПодбораКурьераКЗаказу(Заказ, Перечисления.СтадииПодбораКурьераКЗаказу.ГотовыеКурьерыСПриоритетом);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурьерыПриоритетныеМагазины.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Курьеры.ПриоритетныеМагазины КАК КурьерыПриоритетныеМагазины
		|ГДЕ
		|	КурьерыПриоритетныеМагазины.Магазин = &Магазин
		|	И КурьерыПриоритетныеМагазины.Ссылка.ГотовностьКРаботе = ЗНАЧЕНИЕ(Перечисление.СтатусыГотовностиКурьеровКРаботе.Готов)";	
	Запрос.УстановитьПараметр("Магазин", Магазин);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Курьер = ВыборкаДетальныеЗаписи.Ссылка;
		ПредложитьКурьеруЗаказ(Заказ, Курьер)
	КонецЦикла;
КонецПроцедуры  

Процедура ПредложитьЗаказГотовымКурьерам(Заказ)
	НачатьНовыйЭтапПодбораКурьераКЗаказу(Заказ, Перечисления.СтадииПодбораКурьераКЗаказу.ГотовыеКурьеры);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Курьеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Курьеры КАК Курьеры
		|ГДЕ
		|	Курьеры.ГотовностьКРаботе = ЗНАЧЕНИЕ(Перечисление.СтатусыГотовностиКурьеровКРаботе.Готов)";	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Курьер = ВыборкаДетальныеЗаписи.Ссылка;
		ПредложитьКурьеруЗаказ(Заказ, Курьер);
	КонецЦикла;
КонецПроцедуры 


Процедура НачатьНовыйЭтапПодбораКурьераКЗаказу(Заказ, Этап)  
	МенеджерЗаписиЭтап = РегистрыСведений.ЭтапыПодбораКурьераКЗаказу.СоздатьМенеджерЗаписи();
	МенеджерЗаписиЭтап.Заказ = Заказ; 
	МенеджерЗаписиЭтап.Период = ТекущаяДата(); 
	МенеджерЗаписиЭтап.Этап = Этап;
	МенеджерЗаписиЭтап.Записать(); 	
КонецПроцедуры


Процедура ПредложитьКурьеруЗаказ(Заказ, Курьер)
	МенеджерЗаписиПредложениеКурьеру = РегистрыСведений.ПодборКурьераКЗаказу.СоздатьМенеджерЗаписи();
	МенеджерЗаписиПредложениеКурьеру.Заказ = Заказ;
	МенеджерЗаписиПредложениеКурьеру.Период = ТекущаяДата();
	МенеджерЗаписиПредложениеКурьеру.Курьер = Курьер; 
	МенеджерЗаписиПредложениеКурьеру.ОтветКурьера = Перечисления.СтатусыПодбораКурьераКЗаказу.НетОтвета;
	МенеджерЗаписиПредложениеКурьеру.Записать();	
КонецПроцедуры
